In [1]:
import pandas as pd

data = {
    'Name': ['Amit', 'Riya', 'Sohan', None, 'Riya'],
    'Marks': [90, None, 75, 65, 90],
    'Grade': ['A+', 'B', 'A', 'C', 'B']
}

df = pd.DataFrame(data)
print(df)

    Name  Marks Grade
0   Amit   90.0    A+
1   Riya    NaN     B
2  Sohan   75.0     A
3   None   65.0     C
4   Riya   90.0     B

In [2]:
df.isnull().sum()

Name     1
Marks    1
Grade    0
dtype: int64

In [4]:
df.fillna({"Marks":0},inplace=True)

In [5]:
df

    Name  Marks Grade
0   Amit   90.0    A+
1   Riya    0.0     B
2  Sohan   75.0     A
3   None   65.0     C
4   Riya   90.0     B

In [8]:
df.drop_duplicates(subset=["Name"],inplace=True)

In [9]:
df

    Name  Marks Grade
0   Amit   90.0    A+
1   Riya    0.0     B
2  Sohan   75.0     A
3   None   65.0     C

In [10]:
df.rename(columns={"Marks":"Score"},inplace=True)

In [11]:
df

    Name  Score Grade
0   Amit   90.0    A+
1   Riya    0.0     B
2  Sohan   75.0     A
3   None   65.0     C

In [13]:
df = df[["Grade","Name","Score"]]

In [14]:
df

  Grade   Name  Score
0    A+   Amit   90.0
1     B   Riya    0.0
2     A  Sohan   75.0
3     C   None   65.0

In [15]:
df[df["Score"]>75]

  Grade  Name  Score
0    A+  Amit   90.0

In [20]:
df[(df["Score"] > 75) & (df["Grade"] == 'A+')]

  Grade  Name  Score
0    A+  Amit   90.0

In [21]:
df.to_csv("Raushan.csv",index=False)

In [25]:
df.groupby("Grade")["Score"].min()

Grade
A     75.0
A+    90.0
B      0.0
C     65.0
Name: Score, dtype: float64

In [26]:
df.groupby("Grade")["Score"].count()

Grade
A     1
A+    1
B     1
C     1
Name: Score, dtype: int64

In [27]:
df.groupby("Grade").size()

Grade
A     1
A+    1
B     1
C     1
dtype: int64

In [33]:
df.describe()

          Score
count   4.00000
mean   57.50000
std    39.68627
min     0.00000
25%    48.75000
50%    70.00000
75%    78.75000
max    90.00000

In [34]:
df.sum(numeric_only=True)

Score    230.0
dtype: float64

In [35]:
df.max(numeric_only=True)

Score    90.0
dtype: float64

In [36]:
df["Grade"].value_counts()

Grade
A+    1
B     1
A     1
C     1
Name: count, dtype: int64

In [ ]:
# in %
df["Grade"].value_counts(normalize=True)

Grade
A+    0.25
B     0.25
A     0.25
C     0.25
Name: proportion, dtype: float64

In [ ]:
#also count none values
df["Grade"].value_counts(dropna=True)

Grade
A+    1
B     1
A     1
C     1
Name: count, dtype: int64

In [ ]:
#Arrange in ascending order
df["Grade"].value_counts(ascending=True)

Grade
A+    1
B     1
A     1
C     1
Name: count, dtype: int64

In [ ]:
#ascending order
df.sort_values(by="Score")

  Grade   Name  Score
1     B   Riya    0.0
3     C   None   65.0
2     A  Sohan   75.0
0    A+   Amit   90.0

In [41]:
#descending order
df.sort_values(by="Score",ascending=False)

  Grade   Name  Score
0    A+   Amit   90.0
2     A  Sohan   75.0
3     C   None   65.0
1     B   Riya    0.0

In [42]:
df.groupby(["Grade","Score"]).sum()

              Name
Grade Score
A     75.0   Sohan
A+    90.0    Amit
B     0.0     Riya
C     65.0       0

In [43]:
df.groupby(["Grade","Name"])["Score"].mean()

Grade  Name
A      Sohan    75.0
A+     Amit     90.0
B      Riya      0.0
Name: Score, dtype: float64

In [44]:
df.groupby('Grade')['Score'].agg(['min','max','sum'])

        min   max   sum
Grade
A      75.0  75.0  75.0
A+     90.0  90.0  90.0
B       0.0   0.0   0.0
C      65.0  65.0  65.0

In [45]:
df.groupby('Grade').agg(
    Average=('Score', 'mean'),
    MaxScore=('Score', 'max'),
    Students=('Name', 'count')
)

       Average  MaxScore  Students
Grade
A         75.0      75.0         1
A+        90.0      90.0         1
B          0.0       0.0         1
C         65.0      65.0         0